app/controllers/languages_controller.rb

SELECT "languages".* FROM "languages"
---
  def index
    @languages = Language.all

SELECT "languages".* FROM "languages" WHERE "languages"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @language = Language.find(params[:id])

INSERT INTO "languages" ("created_at", "flag", "locale", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 07 Apr 2013 12:09:54 UTC +00:00], ["flag", "Brazil_Flag.jpg"], ["locale", "pt-BR"], ["name", "Portuguese"], ["updated_at", Sun, 07 Apr 2013 12:09:54 UTC +00:00]]
---
  def create
    @language = Language.new(params[:language])

    if @language.save