app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "isAdmin", "password", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 07 Apr 2013 10:20:43 UTC +00:00], ["email", nil], ["isAdmin", true], ["password", "teste"], ["updated_at", Sun, 07 Apr 2013 10:20:43 UTC +00:00], ["user", "teste"]]
---
  def create
    @user = User.new(params[:user])

    if @user.save